GopalSaraf/Practicals/PSDL/include/proc/pic16f570.h
extern volatile EEADRbits_t EEADRbits __at(0x026);
// bitfield macros
#define _EEADR_EEADR_POSN                                   0x0
#define _EEADR_EEADR_POSITION                               0x0
#define _EEADR_EEADR_SIZE                                   0x6
#define _EEADR_EEADR_LENGTH                                 0x6
#define _EEADR_EEADR_MASK                                   0x3F

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x027);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 027h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nC1WU                  :1;
        unsigned C1PREF                 :1;
        unsigned C1NREF                 :1;
        unsigned C1ON                   :1;
        unsigned nC1T0CS                :1;
        unsigned C1POL                  :1;
        unsigned nC1OUTEN               :1;
        unsigned C1OUT                  :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0x027);
// bitfield macros
#define _CM1CON0_nC1WU_POSN                                 0x0
#define _CM1CON0_nC1WU_POSITION                             0x0
#define _CM1CON0_nC1WU_SIZE                                 0x1
#define _CM1CON0_nC1WU_LENGTH                               0x1
#define _CM1CON0_nC1WU_MASK                                 0x1
#define _CM1CON0_C1PREF_POSN                                0x1
#define _CM1CON0_C1PREF_POSITION                            0x1
#define _CM1CON0_C1PREF_SIZE                                0x1
#define _CM1CON0_C1PREF_LENGTH                              0x1
#define _CM1CON0_C1PREF_MASK                                0x2
#define _CM1CON0_C1NREF_POSN                                0x2
#define _CM1CON0_C1NREF_POSITION                            0x2
#define _CM1CON0_C1NREF_SIZE                                0x1
#define _CM1CON0_C1NREF_LENGTH                              0x1
#define _CM1CON0_C1NREF_MASK                                0x4
#define _CM1CON0_C1ON_POSN                                  0x3
#define _CM1CON0_C1ON_POSITION                              0x3
#define _CM1CON0_C1ON_SIZE                                  0x1
#define _CM1CON0_C1ON_LENGTH                                0x1
#define _CM1CON0_C1ON_MASK                                  0x8
#define _CM1CON0_nC1T0CS_POSN                               0x4
#define _CM1CON0_nC1T0CS_POSITION                           0x4
#define _CM1CON0_nC1T0CS_SIZE                               0x1
#define _CM1CON0_nC1T0CS_LENGTH                             0x1
#define _CM1CON0_nC1T0CS_MASK                               0x10
#define _CM1CON0_C1POL_POSN                                 0x5
#define _CM1CON0_C1POL_POSITION                             0x5
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x20
#define _CM1CON0_nC1OUTEN_POSN                              0x6
#define _CM1CON0_nC1OUTEN_POSITION                          0x6
#define _CM1CON0_nC1OUTEN_SIZE                              0x1
#define _CM1CON0_nC1OUTEN_LENGTH                            0x1
#define _CM1CON0_nC1OUTEN_MASK                              0x40
#define _CM1CON0_C1OUT_POSN                                 0x7
#define _CM1CON0_C1OUT_POSITION                             0x7
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x80

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x028);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 028h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned nC2WU                  :1;
        unsigned C2PREF1                :1;
        unsigned C2NREF                 :1;
        unsigned C2ON                   :1;
        unsigned C2PREF2                :1;
        unsigned C2POL                  :1;
        unsigned nC2OUTEN               :1;
        unsigned C2OUT                  :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x028);
// bitfield macros
#define _CM2CON0_nC2WU_POSN                                 0x0
#define _CM2CON0_nC2WU_POSITION                             0x0
#define _CM2CON0_nC2WU_SIZE                                 0x1
#define _CM2CON0_nC2WU_LENGTH                               0x1
#define _CM2CON0_nC2WU_MASK                                 0x1
#define _CM2CON0_C2PREF1_POSN                               0x1
#define _CM2CON0_C2PREF1_POSITION                           0x1
#define _CM2CON0_C2PREF1_SIZE                               0x1
#define _CM2CON0_C2PREF1_LENGTH                             0x1
#define _CM2CON0_C2PREF1_MASK                               0x2
#define _CM2CON0_C2NREF_POSN                                0x2
#define _CM2CON0_C2NREF_POSITION                            0x2
#define _CM2CON0_C2NREF_SIZE                                0x1
#define _CM2CON0_C2NREF_LENGTH                              0x1
#define _CM2CON0_C2NREF_MASK                                0x4
#define _CM2CON0_C2ON_POSN                                  0x3
#define _CM2CON0_C2ON_POSITION                              0x3
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x8
#define _CM2CON0_C2PREF2_POSN                               0x4
#define _CM2CON0_C2PREF2_POSITION                           0x4
#define _CM2CON0_C2PREF2_SIZE                               0x1
#define _CM2CON0_C2PREF2_LENGTH                             0x1
#define _CM2CON0_C2PREF2_MASK                               0x10
#define _CM2CON0_C2POL_POSN                                 0x5
#define _CM2CON0_C2POL_POSITION                             0x5
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x20
#define _CM2CON0_nC2OUTEN_POSN                              0x6
#define _CM2CON0_nC2OUTEN_POSITION                          0x6
#define _CM2CON0_nC2OUTEN_SIZE                              0x1
#define _CM2CON0_nC2OUTEN_LENGTH                            0x1
#define _CM2CON0_nC2OUTEN_MASK                              0x40
#define _CM2CON0_C2OUT_POSN                                 0x7
#define _CM2CON0_C2OUT_POSITION                             0x7
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x80

// Register: VRCON
#define VRCON VRCON
extern volatile unsigned char           VRCON               __at(0x029);
#ifndef _LIB_BUILD
asm("VRCON equ 029h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VR                     :4;
        unsigned VRR                    :1;
        unsigned VROE2                  :1;
        unsigned VROE1                  :1;
        unsigned VREN                   :1;
    };
    struct {
        unsigned VR0                    :1;
        unsigned VR1                    :1;
        unsigned VR2                    :1;
        unsigned VR3                    :1;
    };
} VRCONbits_t;
extern volatile VRCONbits_t VRCONbits __at(0x029);
// bitfield macros
#define _VRCON_VR_POSN                                      0x0
#define _VRCON_VR_POSITION                                  0x0
#define _VRCON_VR_SIZE                                      0x4
#define _VRCON_VR_LENGTH                                    0x4
#define _VRCON_VR_MASK                                      0xF
#define _VRCON_VRR_POSN                                     0x4
#define _VRCON_VRR_POSITION                                 0x4
#define _VRCON_VRR_SIZE                                     0x1
#define _VRCON_VRR_LENGTH                                   0x1
#define _VRCON_VRR_MASK                                     0x10
#define _VRCON_VROE2_POSN                                   0x5
#define _VRCON_VROE2_POSITION                               0x5
#define _VRCON_VROE2_SIZE                                   0x1
#define _VRCON_VROE2_LENGTH                                 0x1
#define _VRCON_VROE2_MASK                                   0x20
#define _VRCON_VROE1_POSN                                   0x6
#define _VRCON_VROE1_POSITION                               0x6
#define _VRCON_VROE1_SIZE                                   0x1
#define _VRCON_VROE1_LENGTH                                 0x1
#define _VRCON_VROE1_MASK                                   0x40
#define _VRCON_VREN_POSN                                    0x7
#define _VRCON_VREN_POSITION                                0x7
#define _VRCON_VREN_SIZE                                    0x1
#define _VRCON_VREN_LENGTH                                  0x1
#define _VRCON_VREN_MASK                                    0x80
#define _VRCON_VR0_POSN                                     0x0
#define _VRCON_VR0_POSITION                                 0x0
#define _VRCON_VR0_SIZE                                     0x1
#define _VRCON_VR0_LENGTH                                   0x1
#define _VRCON_VR0_MASK                                     0x1
#define _VRCON_VR1_POSN                                     0x1
#define _VRCON_VR1_POSITION                                 0x1
#define _VRCON_VR1_SIZE                                     0x1
#define _VRCON_VR1_LENGTH                                   0x1
#define _VRCON_VR1_MASK                                     0x2
#define _VRCON_VR2_POSN                                     0x2
#define _VRCON_VR2_POSITION                                 0x2
#define _VRCON_VR2_SIZE                                     0x1
#define _VRCON_VR2_LENGTH                                   0x1
#define _VRCON_VR2_MASK                                     0x4
#define _VRCON_VR3_POSN                                     0x3
#define _VRCON_VR3_POSITION                                 0x3
#define _VRCON_VR3_SIZE                                     0x1
#define _VRCON_VR3_LENGTH                                   0x1
#define _VRCON_VR3_MASK                                     0x8

// Register: ANSEL
#define ANSEL ANSEL
extern volatile unsigned char           ANSEL               __at(0x02A);
#ifndef _LIB_BUILD
asm("ANSEL equ 02Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ANS4                   :1;
        unsigned ANS5                   :1;
        unsigned ANS6                   :1;
        unsigned ANS7                   :1;
    };
} ANSELbits_t;
extern volatile ANSELbits_t ANSELbits __at(0x02A);
// bitfield macros
#define _ANSEL_ANS0_POSN                                    0x0
#define _ANSEL_ANS0_POSITION                                0x0
#define _ANSEL_ANS0_SIZE                                    0x1
#define _ANSEL_ANS0_LENGTH                                  0x1
#define _ANSEL_ANS0_MASK                                    0x1
#define _ANSEL_ANS1_POSN                                    0x1
#define _ANSEL_ANS1_POSITION                                0x1
#define _ANSEL_ANS1_SIZE                                    0x1
#define _ANSEL_ANS1_LENGTH                                  0x1
#define _ANSEL_ANS1_MASK                                    0x2
#define _ANSEL_ANS2_POSN                                    0x2
#define _ANSEL_ANS2_POSITION                                0x2
#define _ANSEL_ANS2_SIZE                                    0x1
#define _ANSEL_ANS2_LENGTH                                  0x1
#define _ANSEL_ANS2_MASK                                    0x4
#define _ANSEL_ANS3_POSN                                    0x3
#define _ANSEL_ANS3_POSITION                                0x3
#define _ANSEL_ANS3_SIZE                                    0x1
#define _ANSEL_ANS3_LENGTH                                  0x1
#define _ANSEL_ANS3_MASK                                    0x8
#define _ANSEL_ANS4_POSN                                    0x4
#define _ANSEL_ANS4_POSITION                                0x4
#define _ANSEL_ANS4_SIZE                                    0x1
#define _ANSEL_ANS4_LENGTH                                  0x1
#define _ANSEL_ANS4_MASK                                    0x10
#define _ANSEL_ANS5_POSN                                    0x5
#define _ANSEL_ANS5_POSITION                                0x5
#define _ANSEL_ANS5_SIZE                                    0x1
#define _ANSEL_ANS5_LENGTH                                  0x1
#define _ANSEL_ANS5_MASK                                    0x20
#define _ANSEL_ANS6_POSN                                    0x6
#define _ANSEL_ANS6_POSITION                                0x6
#define _ANSEL_ANS6_SIZE                                    0x1
#define _ANSEL_ANS6_LENGTH                                  0x1
#define _ANSEL_ANS6_MASK                                    0x40
#define _ANSEL_ANS7_POSN                                    0x7
#define _ANSEL_ANS7_POSITION                                0x7
#define _ANSEL_ANS7_SIZE                                    0x1
#define _ANSEL_ANS7_LENGTH                                  0x1
#define _ANSEL_ANS7_MASK                                    0x80

// Register: IW
#define IW IW
extern volatile unsigned char           IW                  __at(0x061);
#ifndef _LIB_BUILD
asm("IW equ 061h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IWREG                  :8;
    };
} IWbits_t;
extern volatile IWbits_t IWbits __at(0x061);
// bitfield macros
#define _IW_IWREG_POSN                                      0x0
#define _IW_IWREG_POSITION                                  0x0
#define _IW_IWREG_SIZE                                      0x8
#define _IW_IWREG_LENGTH                                    0x8
#define _IW_IWREG_MASK                                      0xFF

