GopalSaraf/Practicals/PSDL/include/proc/pic16f570.h
extern volatile IFSRbits_t IFSRbits __at(0x067);
// bitfield macros
#define _IFSR_IFSR_POSN                                     0x0
#define _IFSR_IFSR_POSITION                                 0x0
#define _IFSR_IFSR_SIZE                                     0x8
#define _IFSR_IFSR_LENGTH                                   0x8
#define _IFSR_IFSR_MASK                                     0xFF

// Register: IBSR
#define IBSR IBSR
extern volatile unsigned char           IBSR                __at(0x068);
#ifndef _LIB_BUILD
asm("IBSR equ 068h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IBSR                   :3;
    };
} IBSRbits_t;
extern volatile IBSRbits_t IBSRbits __at(0x068);
// bitfield macros
#define _IBSR_IBSR_POSN                                     0x0
#define _IBSR_IBSR_POSITION                                 0x0
#define _IBSR_IBSR_SIZE                                     0x3
#define _IBSR_IBSR_LENGTH                                   0x3
#define _IBSR_IBSR_MASK                                     0x7

// Register: OPACON
#define OPACON OPACON
extern volatile unsigned char           OPACON              __at(0x069);
#ifndef _LIB_BUILD
asm("OPACON equ 069h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OPA1ON                 :1;
        unsigned OPA2ON                 :1;
    };
} OPACONbits_t;
extern volatile OPACONbits_t OPACONbits __at(0x069);
// bitfield macros
#define _OPACON_OPA1ON_POSN                                 0x0
#define _OPACON_OPA1ON_POSITION                             0x0
#define _OPACON_OPA1ON_SIZE                                 0x1
#define _OPACON_OPA1ON_LENGTH                               0x1
#define _OPACON_OPA1ON_MASK                                 0x1
#define _OPACON_OPA2ON_POSN                                 0x1
#define _OPACON_OPA2ON_POSITION                             0x1
#define _OPACON_OPA2ON_SIZE                                 0x1
#define _OPACON_OPA2ON_LENGTH                               0x1
#define _OPACON_OPA2ON_MASK                                 0x2

// Register: OPTION
#define OPTION OPTION
extern volatile __control unsigned char OPTION              __at(0x000);

// Register: TRISA
#define TRISA TRISA
extern volatile __control unsigned char TRISA               __at(0x006);

// Register: TRISB
#define TRISB TRISB
extern volatile __control unsigned char TRISB               __at(0x007);

// Register: TRISC
#define TRISC TRISC
extern volatile __control unsigned char TRISC               __at(0x008);

/*
 * OPTION bits
 */
#define                                 PS                  0x7
#define                                 PSA                 0x8
#define                                 T0SE                0x10
#define                                 T0CS                0x20
#define                                 nRBPU               0x40
#define                                 nRBWU               0x80
#define                                 PS0                 0x1
#define                                 PS1                 0x2
#define                                 PS2                 0x4

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&01Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&01FFh)
#endif
// ADCON0<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4E);	// @ (0x9 * 8 + 6)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON0,6)
// ADCON0<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4F);	// @ (0x9 * 8 + 7)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON0,7)
// INTCON1<ADIE>
extern volatile __bit                   ADIE                __at(0x32F);	// @ (0x65 * 8 + 7)
#define                                 ADIE_bit            _BIT_ACCESS(INTCON1,7)
// INTCON0<ADIF>
extern volatile __bit                   ADIF                __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 ADIF_bit            _BIT_ACCESS(INTCON0,7)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x48);	// @ (0x9 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ADRES<ADRES0>
extern volatile __bit                   ADRES0              __at(0x50);	// @ (0xA * 8 + 0)
#define                                 ADRES0_bit          _BIT_ACCESS(ADRES,0)
// ADRES<ADRES1>
extern volatile __bit                   ADRES1              __at(0x51);	// @ (0xA * 8 + 1)
#define                                 ADRES1_bit          _BIT_ACCESS(ADRES,1)
// ADRES<ADRES2>
extern volatile __bit                   ADRES2              __at(0x52);	// @ (0xA * 8 + 2)
#define                                 ADRES2_bit          _BIT_ACCESS(ADRES,2)
// ADRES<ADRES3>
extern volatile __bit                   ADRES3              __at(0x53);	// @ (0xA * 8 + 3)
#define                                 ADRES3_bit          _BIT_ACCESS(ADRES,3)
// ADRES<ADRES4>
extern volatile __bit                   ADRES4              __at(0x54);	// @ (0xA * 8 + 4)
#define                                 ADRES4_bit          _BIT_ACCESS(ADRES,4)
// ADRES<ADRES5>
extern volatile __bit                   ADRES5              __at(0x55);	// @ (0xA * 8 + 5)
#define                                 ADRES5_bit          _BIT_ACCESS(ADRES,5)
// ADRES<ADRES6>
extern volatile __bit                   ADRES6              __at(0x56);	// @ (0xA * 8 + 6)
#define                                 ADRES6_bit          _BIT_ACCESS(ADRES,6)
// ADRES<ADRES7>
extern volatile __bit                   ADRES7              __at(0x57);	// @ (0xA * 8 + 7)
#define                                 ADRES7_bit          _BIT_ACCESS(ADRES,7)
// ANSEL<ANS0>
extern volatile __bit                   ANS0                __at(0x150);	// @ (0x2A * 8 + 0)
#define                                 ANS0_bit            _BIT_ACCESS(ANSEL,0)
// ANSEL<ANS1>
extern volatile __bit                   ANS1                __at(0x151);	// @ (0x2A * 8 + 1)
#define                                 ANS1_bit            _BIT_ACCESS(ANSEL,1)
// ANSEL<ANS2>
extern volatile __bit                   ANS2                __at(0x152);	// @ (0x2A * 8 + 2)
#define                                 ANS2_bit            _BIT_ACCESS(ANSEL,2)
// ANSEL<ANS3>
extern volatile __bit                   ANS3                __at(0x153);	// @ (0x2A * 8 + 3)
#define                                 ANS3_bit            _BIT_ACCESS(ANSEL,3)
// ANSEL<ANS4>
extern volatile __bit                   ANS4                __at(0x154);	// @ (0x2A * 8 + 4)
#define                                 ANS4_bit            _BIT_ACCESS(ANSEL,4)
// ANSEL<ANS5>
extern volatile __bit                   ANS5                __at(0x155);	// @ (0x2A * 8 + 5)
#define                                 ANS5_bit            _BIT_ACCESS(ANSEL,5)
// ANSEL<ANS6>
extern volatile __bit                   ANS6                __at(0x156);	// @ (0x2A * 8 + 6)
#define                                 ANS6_bit            _BIT_ACCESS(ANSEL,6)
// ANSEL<ANS7>
extern volatile __bit                   ANS7                __at(0x157);	// @ (0x2A * 8 + 7)
#define                                 ANS7_bit            _BIT_ACCESS(ANSEL,7)
// CM1CON0<C1NREF>
extern volatile __bit                   C1NREF              __at(0x13A);	// @ (0x27 * 8 + 2)
#define                                 C1NREF_bit          _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x13B);	// @ (0x27 * 8 + 3)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,3)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x13F);	// @ (0x27 * 8 + 7)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x13D);	// @ (0x27 * 8 + 5)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1PREF>
extern volatile __bit                   C1PREF              __at(0x139);	// @ (0x27 * 8 + 1)
#define                                 C1PREF_bit          _BIT_ACCESS(CM1CON0,1)
// CM2CON0<C2NREF>
extern volatile __bit                   C2NREF              __at(0x142);	// @ (0x28 * 8 + 2)
#define                                 C2NREF_bit          _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x143);	// @ (0x28 * 8 + 3)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,3)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x147);	// @ (0x28 * 8 + 7)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x145);	// @ (0x28 * 8 + 5)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2PREF1>
extern volatile __bit                   C2PREF1             __at(0x141);	// @ (0x28 * 8 + 1)
#define                                 C2PREF1_bit         _BIT_ACCESS(CM2CON0,1)
// CM2CON0<C2PREF2>
extern volatile __bit                   C2PREF2             __at(0x144);	// @ (0x28 * 8 + 4)
#define                                 C2PREF2_bit         _BIT_ACCESS(CM2CON0,4)
// OSCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 CAL0_bit            _BIT_ACCESS(OSCCAL,1)
// OSCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 CAL1_bit            _BIT_ACCESS(OSCCAL,2)
// OSCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 CAL2_bit            _BIT_ACCESS(OSCCAL,3)
// OSCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 CAL3_bit            _BIT_ACCESS(OSCCAL,4)
// OSCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 CAL4_bit            _BIT_ACCESS(OSCCAL,5)
// OSCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 CAL5_bit            _BIT_ACCESS(OSCCAL,6)
// OSCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 CAL6_bit            _BIT_ACCESS(OSCCAL,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4A);	// @ (0x9 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4B);	// @ (0x9 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4C);	// @ (0x9 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4D);	// @ (0x9 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// INTCON1<CWIE>
extern volatile __bit                   CWIE                __at(0x32E);	// @ (0x65 * 8 + 6)
#define                                 CWIE_bit            _BIT_ACCESS(INTCON1,6)
// INTCON0<CWIF>
extern volatile __bit                   CWIF                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 CWIF_bit            _BIT_ACCESS(INTCON0,6)
// EECON<FREE>
extern volatile __bit                   FREE                __at(0x10C);	// @ (0x21 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(EECON,4)
// INTCON0<GIE>
extern volatile __bit                   GIE                 __at(0x58);	// @ (0xB * 8 + 0)
#define                                 GIE_bit             _BIT_ACCESS(INTCON0,0)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// ADCON0<NOT_DONE>
extern volatile __bit                   NOT_DONE            __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 NOT_DONE_bit        _BIT_ACCESS(ADCON0,1)
// OPACON<OPA1ON>
extern volatile __bit                   OPA1ON              __at(0x348);	// @ (0x69 * 8 + 0)
#define                                 OPA1ON_bit          _BIT_ACCESS(OPACON,0)
// OPACON<OPA2ON>
extern volatile __bit                   OPA2ON              __at(0x349);	// @ (0x69 * 8 + 1)
#define                                 OPA2ON_bit          _BIT_ACCESS(OPACON,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x34);	// @ (0x6 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x36);	// @ (0x6 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x37);	// @ (0x6 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x3E);	// @ (0x7 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON1<RBIE>
extern volatile __bit                   RBIE                __at(0x32C);	// @ (0x65 * 8 + 4)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON1,4)
// INTCON0<RBIF>
extern volatile __bit                   RBIF                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON0,4)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x46);	// @ (0x8 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x47);	// @ (0x8 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// EECON<RD>
extern volatile __bit                   RD                  __at(0x108);	// @ (0x21 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON,0)
// INTCON1<T0IE>
extern volatile __bit                   T0IE                __at(0x32D);	// @ (0x65 * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON1,5)
// INTCON0<T0IF>
extern volatile __bit                   T0IF                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON0,5)
// VRCON<VR0>
extern volatile __bit                   VR0                 __at(0x148);	// @ (0x29 * 8 + 0)
#define                                 VR0_bit             _BIT_ACCESS(VRCON,0)
// VRCON<VR1>
extern volatile __bit                   VR1                 __at(0x149);	// @ (0x29 * 8 + 1)
#define                                 VR1_bit             _BIT_ACCESS(VRCON,1)
// VRCON<VR2>
extern volatile __bit                   VR2                 __at(0x14A);	// @ (0x29 * 8 + 2)
#define                                 VR2_bit             _BIT_ACCESS(VRCON,2)
// VRCON<VR3>
extern volatile __bit                   VR3                 __at(0x14B);	// @ (0x29 * 8 + 3)
#define                                 VR3_bit             _BIT_ACCESS(VRCON,3)
// VRCON<VREN>
extern volatile __bit                   VREN                __at(0x14F);	// @ (0x29 * 8 + 7)
#define                                 VREN_bit            _BIT_ACCESS(VRCON,7)
// VRCON<VROE1>
extern volatile __bit                   VROE1               __at(0x14E);	// @ (0x29 * 8 + 6)
#define                                 VROE1_bit           _BIT_ACCESS(VRCON,6)
// VRCON<VROE2>
extern volatile __bit                   VROE2               __at(0x14D);	// @ (0x29 * 8 + 5)
#define                                 VROE2_bit           _BIT_ACCESS(VRCON,5)
// VRCON<VRR>
extern volatile __bit                   VRR                 __at(0x14C);	// @ (0x29 * 8 + 4)
#define                                 VRR_bit             _BIT_ACCESS(VRCON,4)
// EECON<WR>
extern volatile __bit                   WR                  __at(0x109);	// @ (0x21 * 8 + 1)
#define                                 WR_bit              _BIT_ACCESS(EECON,1)
// EECON<WREN>
extern volatile __bit                   WREN                __at(0x10A);	// @ (0x21 * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON,2)
// EECON<WRERR>
extern volatile __bit                   WRERR               __at(0x10B);	// @ (0x21 * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON,3)
// INTCON1<WUR>
extern volatile __bit                   WUR                 __at(0x328);	// @ (0x65 * 8 + 0)
#define                                 WUR_bit             _BIT_ACCESS(INTCON1,0)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x1A);	// @ (0x3 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// CM1CON0<nC1OUTEN>
extern volatile __bit                   nC1OUTEN            __at(0x13E);	// @ (0x27 * 8 + 6)
#define                                 nC1OUTEN_bit        _BIT_ACCESS(CM1CON0,6)
// CM1CON0<nC1T0CS>
extern volatile __bit                   nC1T0CS             __at(0x13C);	// @ (0x27 * 8 + 4)
#define                                 nC1T0CS_bit         _BIT_ACCESS(CM1CON0,4)
// CM1CON0<nC1WU>
extern volatile __bit                   nC1WU               __at(0x138);	// @ (0x27 * 8 + 0)
#define                                 nC1WU_bit           _BIT_ACCESS(CM1CON0,0)
// CM2CON0<nC2OUTEN>
extern volatile __bit                   nC2OUTEN            __at(0x146);	// @ (0x28 * 8 + 6)
#define                                 nC2OUTEN_bit        _BIT_ACCESS(CM2CON0,6)
// CM2CON0<nC2WU>
extern volatile __bit                   nC2WU               __at(0x140);	// @ (0x28 * 8 + 0)
#define                                 nC2WU_bit           _BIT_ACCESS(CM2CON0,0)

#endif // _PIC16F570_H_
